In [6]:
import numpy as np
import pandas as pd

In [7]:
df_student_test_math_data = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                                         'ID':[10,56,31,85,9,22]
                                         })

In [8]:
df_student_test_science_data = pd.DataFrame({'student':['Tom','Ram','David'],
                                            'ID':[10,85,22]
                                            })

In [9]:
df_student_test_math_data

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22

In [10]:
df_student_test_science_data

  student  ID
0     Tom  10
1     Ram  85
2   David  22

In [18]:
df_student_test_math_data.join(df_student_test_science_data, lsuffix='_M', rsuffix='_S')

  student_M  ID_M student_S  ID_S
0       Tom    10       Tom  10.0
1      Jack    56       Ram  85.0
2       Dan    31     David  22.0
3       Ram    85       NaN   NaN
4      Jeff     9       NaN   NaN
5     David    22       NaN   NaN

In [11]:
pd.merge(df_student_test_math_data,df_student_test_science_data)

  student  ID
0     Tom  10
1     Ram  85
2   David  22

In [13]:
pd.merge(left = df_student_test_math_data,
         right = df_student_test_science_data,
         on='student',
        how ='inner')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    85
2   David    22    22

In [14]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='right')

  student_x  ID student_y
0       Tom  10       Tom
1       Ram  85       Ram
2     David  22     David

In [17]:
(pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='left')).fillna('-')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         -
2       Dan  31         -
3       Ram  85       Ram
4      Jeff   9         -
5     David  22     David

In [8]:
pd.merge(df_student_test_math_data,df_student_test_science_data,on='ID',how='outer')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56       NaN
2       Dan  31       NaN
3       Ram  85       Ram
4      Jeff   9       NaN
5     David  22     David

In [21]:
lst = [df_student_test_math_data,df_student_test_science_data]
pd.concat(lst ,ignore_index=True, axis=0)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  85
8   David  22

## Drop duplicates

In [22]:
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                         'ID':[10,56,10,85,9,56]
                                         })

In [23]:
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [24]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [25]:
df_student_survey_data.drop_duplicates()

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [26]:
df_student_survey_data.drop_duplicates(['student'])

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [27]:
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9